{
  "menu_text_about": "About",
  "menu_text_experience": "Experience",
  "menu_text_work": "Projects",
  "menu_text_blog": "Blog",
  "menu_text_gallery": "Gallery",
  "menu_text_contact": "Contact",

  "hero_txt_keywords": "Computer Engineer, Artificial Intelligence, Data Science, Full Stack Development, University Lecturer.",
  "hero_txt_about": "Software Engineer with over four years of experience developing scalable and efficient digital products for startups and organizations, combining technical expertise with strong problem-solving skills, business insight, and user-centered design.",
  "hero_btn_resume": "Get in touch",
  "hero_text_proud": "Proudly from 🇨🇷",
  "hero_txt_creai": "Currently shipping features at",

  "about_text_title": "About Me",
  "about_text_tec": "Technological Institute of Costa Rica",
  "about_text_desc_1": "Hello! I am Angelo Ortiz Vega, a Computer Engineer and AI Practitioner with over four years of experience developing scalable and efficient digital products for startups and organizations. I combine technical expertise in software engineering with strong problem-solving skills, business insight, and user-centered design. Skilled in Python development with frameworks such as Flask and FastAPI, cloud integrations with AWS, and modern full stack technologies including React,Angular, and Node.js.",
  "about_text_desc_2": "My work in Artificial Intelligence spans building and integrating machine learning modelsinto production systems, designing data pipelines, and applying automation to optimize workflows. I've developed predictive systems, intelligent agents, and RPA solutions using frameworks likescikit-learn, TensorFlow, and PyTorch. I'm passionate about bridging the gap between AI research and real-world applications that improve efficiency, sustainability, and user experience.",
  "about_text_desc_3_1": "I am currently completing a degree in Computer Engineering at the ",
  "about_text_desc_3_2": "strengthening my theoretical and analytical foundation. The program focuses on the sciences and technologies that enable the design, construction, implementation, and maintenance of computer systems — both hardware and software.",
  "about_text_desc_4_1": "In parallel, I have worked as a university lecturer for over three years, teaching Artificial Intelligence, Data Analysis, Full Stack Development, and UX Design at ",
  "about_text_desc_4_2": "with a focus on practical, project-based learning and real-world applications.",
  "about_text_desc_5": "When I'm not at the computer, I'm usually hiking, reading, hanging out with friends, or curating ",

  "skills_text_title": "Skills & Stack",
  "skills_text_subtitle": "Technologies and tools I work with",
  "skills_text_dw": "Web Development",
  "skills_text_ds": "Data Science & Analytics",
  "skills_text_ml": "ML & AI",
  "skills_text_di": "DevOps & Infrastructure",

  "experience_text_title": "Where I've Worked",
  "job_title_ucreativa": "University Lecturer",
  "jobs_ucreativa": [
    "Enriched the learning experience by incorporating real-world case studies, collaborative projects, and innovative teaching methodologies.",
    "Mentored students in the development of capstone projects and functional prototypes aligned with current industry practices.",
    "Structured and authored the complete UX Design Certification program, including courses such as Research for Digital Experiences, Solution Ideation, Design Principles, and Interaction & Usability.",
    "Delivered courses in Python for AI, Applied AI, and Machine Learning & Deep Learning, with emphasis on backend development, API creation, and deployment on AWS cloud services."
  ],

  "job_title_freelancer1": "Software Engineer",
  "jobs_freelancer1": [
    "Delivered end-to-end software solutions for startups and diverse clients, combining robust backend development,cloud integration, process automation, and frontend development.",
    "Focused on building scalable, maintainable, and efficient systems using modern technologies and best engineering practices. "
  ],

  "job_title_creai": "Full Stack Software Engineer for AI",
  "jobs_creai": [
    "Full-stack development of applications and APIs that power Creai's AI solutions, using Ember.js, React, PHP, Laravel, and Python.",
    "Collaboration with data science and product teams to integrate ML/AI features into production systems.",
    "Building and maintaining scalable web systems that support AI-powered products."
  ],

  "job_title_qubosystems": "Software Engineer",
  "jobs_qubosystems": [
    "Designed and implemented end-to-end components for internal and client-facing initiatives, including REST APIs and admin dashboards.",
    "Served as technical lead on several full-stack projects with a strong focus on frontend development using React.",
    "Delivered scalable solutions across the full stack, from backend services to user interfaces."
  ],

  "jobs_scroll_left": "Scroll tabs left",
  "jobs_scroll_right": "Scroll tabs right",
  "job_title_csi": "Electronic Technician",
  "jobs_csi": [
    "Corrective and preventive maintenance of electrical equipment.",
    "Support to engineers in the development and design of electronic equipment that will improve the cap production process.",
    "Accompaniment in the elaboration of the main electrical maintenance plan of the plant."
  ],

  "projects_text_title": "Some Things I've Built",
  "projects_text_featured": "Featured Project",
  "projects_angelortizvcom": "angelortizv.com is a website where whenever I have the opportunity, I leave a few minutes of what I am doing to share what I am learning or what I am thinking.",
  "projects_easyhop": "Easy Hop is the only platform in Costa Rica that connects private group shuttles with visitors in both rural, and touristic destinations. Within the project I was in charge of developing the mobile application for drivers, whose main function was to see the stopping points on a map and validate passenger tickets.",
  "projects_topspinai": "Table tennis is a fast-paced and dynamic sport where coaches, players and analysts require accurate tools to assess performance in real-time. The absence of advanced systems that can process and analyse high-resolution video to detect critical events such as ball bounces and net hits limits users' ability to make informed decisions. TopspinAI addresses this need by providing an automated system that uses artificial intelligence for ball detection and semantic segmentation, improving analysis and decision making during matches.",
  "projects_uxarc": "ux-arc is a personal blog and repository dedicated to sharing knowledge, experiences, and resources about the world of user experience design. Over the years, I have collected valuable information on various aspects of digital design, and this space was born with the intention of organizing and disseminating that knowledge in an accessible way for those looking to improve their skills and understanding in the field of UX.",
  "projects_ceitcr": "ce-itcr is the repository where the programming projects that I have carried out throughout my career in Computer Engineering courses are housed. The respective documentation on each course and code is on github.",

  "projects_ngClone": "This is a Google Keep clone built with Angular to practice and improve my Angular skills. It follows the original app's design principles and includes many core features.",
  "projects_karaoke": "Karaoke is a project for the course SOA41D - Software Architecture. A simple Karaoke Streaming App build with React for the Front-end and Nodejs for Server-side.",
  "projects_es369ims": "Inventory Management System is an inventory service where products in stock are displayed through categories. Its data source is Excel, so that administrators can access the data more easily.",
  "projects_itcrCourses": "itcr-courses is the repository of my notes in the career of Computer Engineering. The principal purpose of this repository is record some of the data of the courses by the computer engineering degree program of the ITCR.",
  "projects_spaceInvaders": "Space Invaders is a Japanese shooting video game released in 1978 by Taito. In the original planning for the game, they had planned to have the aliens be human soldiers. Taito figured that they did not want to send the message that shooting humans was ok, so they changed it to aliens.",
  "projects_pacman": "Pac-Man is a 1980 maze action video game developed and released by Namco for arcades. I made a clone of the famous game in C ++ and Qt to apply concepts that I learned in courses on Algorithms and Data Structures.",

  "archive_text_title": "Other Noteworthy Projects",
  "archive_text_subtitle": "view the archive",
  "projects_filter_label": "Filter projects by technology",
  "projects_filter_all": "All",
  "projects_show_more": "Show more",

  "blog_section_title": "Latest on the Blog",
  "blog_section_intro": "Recent writing on software, AI, and what I'm learning.",
  "blog_section_link": "View all posts at angelortizv.com",

  "gallery_text_title": "Some things from my life in pictures",
  "gallery_text_less": "Show Less",
  "gallery_text_more": "Show More",
  "gallery_empty": "No photos yet.",
  "gallery_open_lightbox": "View full size",
  "gallery_scroll_left": "Scroll gallery left",
  "gallery_scroll_right": "Scroll gallery right",
  "gallery_lightbox_label": "Photo viewer",
  "gallery_prev": "Previous photo",
  "gallery_next": "Next photo",

  "contact_text_over": "What's Next?",
  "contact_text_title": "Get In Touch",
  "contact_text_desc": "Although I'm not currently looking for freelance opportunities, my inbox is always open. If you have any questions or just want to say hello, I'll do my best to get back to you!",
  "contact_location": "San José, Costa Rica · UTC−6",
  "contact_location_aria": "Location and timezone",
  "contact_btn_hello": "Say Hello",
  "contact_btn_copy": "Copy email",
  "contact_btn_copied": "Copied!",
  "contact_btn_copy_aria": "Copy email address",

  "footer_text_designed": "Designed by",
  "footer_text_build": "Built with 🫀 by",
  "footer_last_updated": "Last updated:",

  "full_archive_text_title": "Archive",
  "full_archive_text_subtitle": "A big list of things I've worked on",
  "full_archive_text_table_year": "Year",
  "full_archive_text_table_title": "Title",
  "full_archive_text_table_made": "Made at",
  "full_archive_text_table_tech": "Built with",

  "accessibility_text_title": "Accessiblity Options",
  "accessibility_text_zoomIn": "Zoom In",
  "accessibility_text_zoomOut": "Zoom Out",
  "accessibility_text_biggerCursor": "Large Cursor",
  "accessibility_text_undoChanges": "Undo Changes",
  "accessibility_text_shortcuts": "Keyboard shortcuts (?)",
  "accessibility_text_grayscale": "Grayscale",
  "accessibility_text_invert": "Invert Colors",

  "general_close": "Close",
  "general_scroll_to_top": "Scroll to top",

  "general_404_notfound": "Page Not Found",
  "general_404_goHome": "Go Home",

  "shortcuts_title": "Keyboard shortcuts",
  "shortcuts_help": "Show this help",
  "shortcuts_close": "Close modal",
  "shortcuts_hint": "Press 1–6 to jump to a section",
  "footer_how_trigger": "how?",
  "footer_how_stack": "Gatsby · React · Styled Components · Netlify"
}
